<img src="Data/movietables.png">

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
import pandas as pd

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "RonHan1995" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "mydb"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
#preview the names of all tables
q="""Show tables;"""
pd.read_sql(q,conn)

  Tables_in_mydb
0         genres
1        ratings
2   title_basics
3   title_genres

In [4]:
q='''Select * from title_basics;'''
pd.read_sql(q,conn)

Empty DataFrame
Columns: [tconst, primary_title, start_year, run_time, ratings_tconst]
Index: []

# Loading cleaned basics data

In [5]:
#Read the title_basic data
basics= pd.read_csv('Data/title_basics_cleaned.csv.gz')
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [6]:
#looking at title_basics table
q="""Describe title_basics"""
describe=pd.read_sql(q,conn)
describe

            Field          Type Null  Key Default Extra
0          tconst   varchar(45)   NO  PRI    None
1   primary_title  varchar(255)  YES         None
2      start_year       char(4)  YES         None
3        run_time   varchar(45)  YES         None
4  ratings_tconst   varchar(45)  YES         None

## Checking basics columns

In [7]:
#looking at title basics columns
describe["Field"].values

array(['tconst', 'primary_title', 'start_year', 'run_time',
       'ratings_tconst'], dtype=object)

In [8]:
#data columns
basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [9]:
#renameing data columns to match table
rename_map={"primaryTitle":"primary_title",
           "startYear":"start_year",
           "runtimeMinutes":"run_time"}
basics=basics.rename(rename_map,axis=1)
basics.head()

,tconst,titleType,primary_title,originalTitle,isAdult,start_year,endYear,run_time,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

## Pulling basics columns wanted for table

In [10]:
#making new dataframe to match table
table_basics=basics[["tconst", "primary_title", "start_year", "run_time"]]
table_basics.head()

,tconst,primary_title,start_year,run_time
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [11]:
#Reviewing SQL table's data types
describe[["Field","Type"]]

            Field          Type
0          tconst   varchar(45)
1   primary_title  varchar(255)
2      start_year       char(4)
3        run_time   varchar(45)
4  ratings_tconst   varchar(45)

In [12]:
#Reviewing dataframe data types
table_basics.dtypes

tconst            object
primary_title     object
start_year       float64
run_time           int64
dtype: object

### Changing start_year from float to int

In [13]:
table_basics["start_year"]=table_basics["start_year"].astype(int)
table_basics["start_year"].info()
table_basics["start_year"].head()

<class 'pandas.core.series.Series'>
RangeIndex: 86979 entries, 0 to 86978
Series name: start_year
Non-Null Count  Dtype
--------------  -----
86979 non-null  int64
dtypes: int64(1)
memory usage: 679.6 KB

/var/folders/zd/1wqdzm7d7d13shmcygx_4src0000gn/T/ipykernel_2295/783504437.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  table_basics["start_year"]=table_basics["start_year"].astype(int)

0    2001
1    2020
2    2018
3    2005
4    2002
Name: start_year, dtype: int64

## Checking for foreign keys

In [14]:
#checking for the foreign key in basics table
q='''Select @@Foreign_key_checks'''
pd.read_sql(q,conn)

   @@Foreign_key_checks
0                     1

In [15]:
#changing the setting for Foreign_key_checks with connection
q='''Set @@Foreign_key_checks=0'''
conn.execute(q)

In [16]:
#Confirm the checks are deactivated
q='''Select @@Foreign_key_checks'''
pd.read_sql(q,conn)

   @@Foreign_key_checks
0                     0

## Merging basic data with table

In [17]:
#inserting the data now that foreign key checks are disabled
table_basics.to_sql("title_basics",conn,index=False,if_exists="append")

86979

In [18]:
#confirm the data has been added
q='''Select * from title_basics limit 5;'''
pd.read_sql(q,conn)

,tconst,primary_title,start_year,run_time,ratings_tconst
0,tt0035423,Kate & Leopold,2001,118,None
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,None
2,tt0069049,The Other Side of the Wind,2018,122,None
3,tt0088751,The Naked Monster,2005,100,None
4,tt0096056,Crime and Punishment,2002,126,None

In [19]:
#checking the describe for no changes
q='''Describe title_basics;'''
pd.read_sql(q,conn)

            Field          Type Null  Key Default Extra
0          tconst   varchar(45)   NO  PRI    None
1   primary_title  varchar(255)  YES         None
2      start_year       char(4)  YES         None
3        run_time   varchar(45)  YES         None
4  ratings_tconst   varchar(45)  YES         None

In [20]:
q='''Select * from ratings;'''
pd.read_sql(q,conn)

Empty DataFrame
Columns: [tconst, avg_rating, number_of_votes]
Index: []

# Loading clean ratings data

In [21]:
ratings=pd.read_csv('Data/title_ratings_cleaned.csv.gz')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

## Checking Rating columns

In [22]:
q='''Describe ratings;'''
describe=pd.read_sql(q,conn)
describe

             Field         Type Null  Key Default Extra
0           tconst  varchar(45)   NO  PRI    None
1       avg_rating        float  YES         None
2  number_of_votes  varchar(45)  YES         None

In [23]:
describe["Field"].values

array(['tconst', 'avg_rating', 'number_of_votes'], dtype=object)

In [24]:
ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [27]:
#renaming dataframe columns to match table
rename_map={'averageRating':'avg_rating',
            'numVotes':'number_of_votes'}
table_ratings=ratings.rename(rename_map,axis=1)
table_ratings.head()

      tconst  avg_rating  number_of_votes
0  tt0035423         6.4            87153
1  tt0062336         6.4              175
2  tt0069049         6.7             7754
3  tt0088751         5.2              336
4  tt0096056         5.6              846

## Merging rating data with table

In [28]:
#inserting data into table
table_ratings.to_sql('ratings',conn,index=False,if_exists="append")

71900

In [29]:
#confirm the data has bee added
q='''Select * from ratings limit 5;'''
pd.read_sql(q,conn)

      tconst  avg_rating number_of_votes
0  tt0035423         6.4           87153
1  tt0062336         6.4             175
2  tt0069049         6.7            7754
3  tt0088751         5.2             336
4  tt0096056         5.6             846

In [30]:
#check the describe again to confirm no changes
q='''Describe ratings;'''
pd.read_sql(q,conn)

             Field         Type Null  Key Default Extra
0           tconst  varchar(45)   NO  PRI    None
1       avg_rating        float  YES         None
2  number_of_votes  varchar(45)  YES         None